app/Models/ClimaModel.php

    public function getClimaByCP(){
        $request = request();
        $cp = $request->getGet('cp'); //Con esto se accede a variables con get/post

        $db = db_connect();
        $sql = $db->table('clima')->select('latitud, longitud, fecha, hora, temperatura')->where('CP',$cp);
        $query = $sql->get();
---
SELECT `latitud`
FROM `clima`
WHERE `CP` = '7'

    public function getClimaByTemperaturaSensacionTermica(){
        $request = request();
        $temperaturaMinima = $request->getGet('temperaturaMinima');
        $sensacionTermicaMinima = $request->getGet('sensacionTermicaMinima');

        $db = db_connect();
        $sql = $db->table('clima')->select('temperatura,ubicacion, latitud, longitud, altitud, fecha, hora')->where('sensacionTermica>=',$sensacionTermicaMinima)->where('temperatura>=',$temperaturaMinima);
        $query = $sql->get();
---
SELECT `ubicacion`, `latitud`, `longitud`, `altitud`, `fecha`, `hora`
FROM `clima`
WHERE `sensacionTermica` >= '30'
AND `temperatura` >= '30'

    public function getClimaByTipoClima(){
        $request = request();
        $tipoClima = $request->getGet('tipoClima');

        $db = db_connect();
        $sql = $db->table('clima')->select('latitud, longitud, altitud, fecha, hora, temperatura')->join('tipoclima','clima.tipo = tipoclima.idTipo')->where('tipoclima.tipo',$tipoClima);
        $query = $sql->get();
---
SELECT `latitud`, `longitud`, `altitud`, `fecha`, `hora`, `temperatura`
FROM `clima`
JOIN `tipoclima` ON `clima`.`tipo` = `tipoclima`.`idTipo`
WHERE `tipoclima`.`tipo` = 'Nublado'

    public function getClimaByTipoClimaUbicacion(){
        $request = request();
        $tipoClima = $request->getGet('tipoClima');
        $ubicacion = $request->getGet('ubicacion');

        $db = db_connect();
        $sql = $db->table('clima')->select('latitud, longitud, altitud, fecha, hora, temperatura')->join('tipoclima','clima.tipo = tipoclima.idTipo')->where('tipoclima.tipo',$tipoClima)->where('ubicacion',$ubicacion);
        $query = $sql->get();
---
SELECT `latitud`, `longitud`, `altitud`, `fecha`, `hora`, `temperatura`
FROM `clima`
JOIN `tipoclima` ON `clima`.`tipo` = `tipoclima`.`idTipo`
WHERE `tipoclima`.`tipo` = 'Seco'
AND `ubicacion` = 'Vieja Croacia'

    public function getClimaByTipoClimaUbicacionTemperatura(){
        $request = request();
        $tipoClima = $request->getGet('tipoClima');
        $ubicacion = $request->getGet('ubicacion');
        $temperaturaMinima = $request->getGet('temperaturaMinima');

        $db = db_connect();
        $sql = $db->table('clima')->select('latitud, longitud, altitud, fecha, hora, temperatura')->join('tipoclima','clima.tipo = tipoclima.idTipo')->where('tipoclima.tipo',$tipoClima)->where('ubicacion',$ubicacion)->where('temperatura>=',$temperaturaMinima);
        $query = $sql->get();
---
SELECT `latitud`, `longitud`, `altitud`, `fecha`, `hora`, `temperatura`
FROM `clima`
JOIN `tipoclima` ON `clima`.`tipo` = `tipoclima`.`idTipo`
WHERE `tipoclima`.`tipo` = 'Seco'
AND `ubicacion` = 'Vieja Croacia'
AND `temperatura` >= '0'

    public function getClimaByTipoClimaAltitudHora(){
        $request = request();
        $tipoClima = $request->getGet('tipoClima');
        $altitudMinima = $request->getGet('altitudMinima');
        $altitudMaxima = $request->getGet('altitudMaxima');
        $horaInicio = $request->getGet('horaInicio');
        $horaFin = $request->getGet('horaFin');

        $db = db_connect();
        $sql = $db->table('clima')->select('ubicacion, fecha, temperatura, sensacionTermica')->join('tipoclima','clima.tipo = tipoclima.idTipo')->where('tipoclima.tipo',$tipoClima)->where('altitud>=',$altitudMinima)->where('altitud<=',$altitudMaxima)->where('hora>=',$horaInicio)->where('hora<=',$horaFin);
        $query = $sql->get();
---
SELECT `ubicacion`, `fecha`, `temperatura`, `sensacionTermica`
FROM `clima`
JOIN `tipoclima` ON `clima`.`tipo` = `tipoclima`.`idTipo`
WHERE `tipoclima`.`tipo` = 'Soleado'
AND `altitud` >= '1000'
AND `altitud` <= '1200'
AND `hora` >= '08:00:00'
AND `hora` <= '20:00:00'

    public function getClimaByHumedadSensacionTermica(){
        $request = request();
        $humedadMinima = $request->getGet('humedadMinima');
        $humedadMaxima = $request->getGet('humedadMaxima');
        $sensacionTermicaMinima = $request->getGet('humedadMinima');
        $sensacionTermicaMaxima = $request->getGet('humedadMaxima');

        $db = db_connect();
        $sql = $db->table('clima')->select('latitud, longitud, altitud, fecha, hora, temperatura')->where('humedad>=',$humedadMinima)->where('humedad<=',$humedadMaxima)->where('sensacionTermica>=',$sensacionTermicaMinima)->where('sensacionTermica<=',$sensacionTermicaMaxima);
        $query = $sql->get();
---
SELECT `latitud`, `longitud`, `altitud`, `fecha`, `hora`, `temperatura`
FROM `clima`
WHERE `humedad` >= '15'
AND `humedad` <= '20'
AND `sensacionTermica` >= '15'
AND `sensacionTermica` <= '20'